/*

# এবার আমরা আমাদের ছাকনি চালু করি এবং প্রাইম বের করি। ২৫ এর নিচের সব প্রাইম আমরা বের করব। ২৫ এর বর্গমূল ৫, তাই ২৫ বা তার থেকে ছোট কোন সংখ্যাকে অবশ্যই ৫ বা তার থেকে ছোট কোনো প্রাইম দিয়ে ভাগ করা যাবে।
-> ২ একটি প্রাইম কারণ ২কে তার বর্গমূলের নিচে কোনো সংখ্যা দিয়ে ভাগ করা যায়না। তাহলে ২ এর মাল্টিপলগুলো কেও প্রাইম নয় কারণ তাদের ২ দিয়ে ভাগ করা যায়,সেগুলোকে আমরা কেটে দেই:
-> -> ২,৪,৬,৮,১০,১২,১৪,১৬,১৮,২০,২২,২৪
-> ২ এর পরের সংখ্যা ৩। ৩ যদি প্রাইম না হতো তাহলে ৩ এর বর্গমূলের নিচের কোনো প্রাইম ৩ কে বাদ দিয়ে দিত,যেহেতু ৩ বাদ পড়েনি তাই সংজ্ঞামতে ৩ প্রাইম। ৩ এর মাল্টিপল গুলো কে বাদ দেই:
-> -> ৩,৬,৯,১২,১৫,১৮,২১,২৪
-> পরের সংখ্যা ৪। ৪ বাদ পড়ে গিয়েছে আগেই। তারপর আছে ৫। ৫ যদি প্রাইম না হতো তাহলে আগেই ছাকনিতে কাটা পড়ত, ৫এর মাল্টিপল গুলোকে কেটে দেই:
-> -> ৫,১০,১৫,২০,২৫

*/
#include <bits/stdc++.h>
#include <vector>
#define ll long long
#define lli long long int
#define nn endl;
using namespace std;
int main()
{
    lli N;
    cin>>N;
    int a[N+1];

    int sq = sqrt(N);
    cout<<"Even Number : ";
    for (int i = 4; i <= N; i += 2)
    {
        cout<<i<<' ';
        a[i] = 1;
    }
    cout<<nn;

    for (int i = 3; i <= sq; i += 2)
    {
        cout<<"Modus "<<i<<" : ";
        if (a[i] == 0)
        {
            for (int j = i * i; j <= N; j += i)
            {
                a[j] = 1;
                cout<<j<<' ';
            }
            cout<<nn;
        }
    }
    return 0;
}
